Repository: dvlproad/001-UIKit-CQDemo-Flutter
Catalog: analyze_video_url_app/lib/l10n/app_*.arb
Languages: ar, pt, zh

# appTitle
source: Video URL Analyzer
ar: محلل روابط الفيديو
pt: Analisador de URL de Vídeo
zh: 视频链接解析器

source: Parsed Videos
ar: مقاطع الفيديو المحللة
pt: Vídeos analisados
zh: 已解析视频

source: No download records
ar: لا توجد سجلات تحميل
pt: Sem registros de download
zh: 暂无下载记录

# videoId
source: Video ID: {id}
ar: معرف الفيديو: {id}
pt: ID do vídeo: {id}
zh: 视频ID: {id}

# addTime
source: Added: {time}
ar: تمت الإضافة: {time}
pt: Adicionado: {time}
zh: 添加时间: {time}

source: Waiting for download...
ar: في انتظار التحميل...
pt: Aguardando download...
zh: 等待下载...

source: Continue download
ar: متابعة التحميل
pt: Continuar download
zh: 继续下载

source: Download complete
ar: اكتمل التحميل
pt: Download concluído
zh: 下载完成

source: Download failed
ar: فشل التحميل
pt: Falha no download
zh: 下载失败

source: Retry
ar: إعادة المحاولة
pt: Tentar novamente
zh: 重试

source: Save to Gallery
ar: حفظ في المعرض
pt: Salvar na galeria
zh: 保存到相册

# downloadCompleteSavePrompt
source: Download complete, save to gallery now?
ar: اكتمل التحميل، هل تريد الحفظ في المعرض الآن؟
pt: Download concluído, salvar na galeria agora?
zh: 下载完成，是否立即保存到相册？

source: Cancel
ar: إلغاء
pt: Cancelar
zh: 取消

source: Save
ar: حفظ
pt: Salvar
zh: 保存

source: Video saved to gallery
ar: تم حفظ الفيديو في المعرض
pt: Vídeo salvo na galeria
zh: 视频已保存到相册

source: Save failed
ar: فشل الحفظ
pt: Falha ao salvar
zh: 保存失败

# saveError
source: Save error: {error}
ar: خطأ في الحفظ: {error}
pt: Erro ao salvar: {error}
zh: 保存失败: {error}

# videoFileNotExist
source: Video file does not exist
ar: ملف الفيديو غير موجود
pt: O arquivo de vídeo não existe
zh: 视频文件不存在

# videoFilePathNotExist
source: Video file path does not exist
ar: مسار ملف الفيديو غير موجود
pt: O caminho do arquivo de vídeo não existe
zh: 视频文件路径不存在

source: Confirm Delete
ar: تأكيد الحذف
pt: Confirmar exclusão
zh: 确认删除

# confirmDeletePrompt
source: Are you sure you want to delete this video?
ar: هل أنت متأكد من أنك تريد حذف هذا الفيديو؟
pt: Tem certeza que deseja excluir este vídeo?
zh: 确定要删除这个视频吗？

source: Delete
ar: حذف
pt: Excluir
zh: 删除

source: Confirm Clear
ar: تأكيد المسح
pt: Confirmar limpeza
zh: 确认清空

# confirmClearPrompt
source: Are you sure you want to clear all parsed videos? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد مسح جميع مقاطع الفيديو المحللة؟ لا يمكن التراجع عن هذا الإجراء.
pt: Tem certeza que deseja limpar todos os vídeos analisados? Esta ação não pode ser desfeita.
zh: 确定要清空所有已解析视频吗？此操作不可恢复。

source: Clear
ar: مسح
pt: Limpar
zh: 清空

source: Video Input
ar: إدخال الفيديو
pt: Entrada de vídeo
zh: 解析输入

# pasteTiktokLink
source: Paste TikTok video link...
ar: الصق رابط تيك توك...
pt: Cole o link do TikTok...
zh: 粘贴 TikTok 视频链接...

source: Get Video
ar: الحصول على الفيديو
pt: Obter vídeo
zh: 获取视频

# parsingFailed
source: Parsing failed: {error}
ar: فشل التحليل: {error}
pt: Falha na análise: {error}
zh: 解析失败: {error}

source: More
ar: المزيد
pt: Mais
zh: 更多

source: Settings
ar: الإعدادات
pt: Configurações
zh: 设置

source: Open Settings
ar: فتح الإعدادات
pt: Abrir configurações
zh: 打开设置

source: Cannot open settings
ar: لا يمكن فتح الإعدادات
pt: Não é possível abrir as configurações
zh: 无法打开设置

# emptyInputRandomDownloadPrompt
source: Input is empty, would you like to download a random video?
ar: الإدخال فارغ، هل تريد تحميل فيديو عشوائي؟
pt: Entrada vazia, deseja baixar um vídeo aleatório?
zh: 输入框为空，是否随机下载一个视频？

source: Random Download
ar: تحميل عشوائي
pt: Download aleatório
zh: 随机下载

# videoLoadFailed
source: Video loading failed, please try again later
ar: فشل تحميل الفيديو، يرجى المحاولة لاحقاً
pt: Falha ao carregar o vídeo, tente novamente mais tarde
zh: 视频加载失败，请稍后重试

source: Video file path not found
ar: مسار ملف الفيديو غير موجود
pt: Caminho do arquivo de vídeo não encontrado
zh: 视频文件路径不存在

source: Video file not found
ar: ملف الفيديو غير موجود
pt: Arquivo de vídeo não encontrado
zh: 视频文件不存在

# videoInitializationFailed
source: Video initialization failed: {error}
ar: فشل تهيئة الفيديو: {error}
pt: Falha na inicialização do vídeo: {error}
zh: 视频初始化失败: {error}

# saveFailedWithError
source: Save failed: {error}
ar: فشل الحفظ: {error}
pt: Falha ao salvar: {error}
zh: 保存失败: {error}

source: Video saved to album
ar: تم حفظ الفيديو في الألبوم
pt: Vídeo salvo no álbum
zh: 视频已保存到相册

# confirmDeleteVideo
source: Confirm Delete
ar: تأكيد الحذف
pt: Confirmar exclusão
zh: 确认删除

# confirmDeleteVideoPrompt
source: Are you sure you want to delete this video?
ar: هل أنت متأكد أنك تريد حذف هذا الفيديو؟
pt: Tem certeza que deseja excluir este vídeo?
zh: 确定要删除这个视频吗？
